[
  {
    "title": "Pokemon",
    "image": "/Project/Pokemon.png",
    "Link": "https://pokemon-five-inky.vercel.app/",
    "github": "https://github.com/Nitesh47kumars/Pokemon",
    "header": "A responsive web app showcasing Pokémon stats using the PokéAPI with advanced data mapping and search functionality.",
    "color": "text-cyan-300",
    "background":"linear-gradient(195deg, #001D4A 30%, #006992 70%, #475569 100%)",
    "description": "A clean, searchable Pokémon showcase built with React and pure CSS. It fetches detailed data like type, stats, and abilities using complex API structures.",
    "features": [
      "Search functionality to filter Pokémon by name instantly.",
      "Displays Pokémon info like type, size, stats, abilities, and experience.",
      "Utilizes nested `.map()` methods to extract data from complex API responses.",
      "Responsive UI styled using pure CSS without any utility frameworks.",
      "Loader/Spinner UI while data is being fetched.",
      "Error handling for invalid or failed API responses."
    ],
    "technologies": [
      "React",
      "JavaScript",
      "CSS3 (Pure)",
      "PokéAPI",
      "Vercel",
      "Axios"
    ]
  }
  ,
  {
    "title": "Info-Nation",
    "image": "/Project/InfoNation.png",
    "Link": "https://info-nation-eight.vercel.app/posts",
    "github": "https://github.com/Nitesh47kumars/Country",
    "header": "A multi-section React application using modern routing and real-world API practices.",
    "color": "text-purple-300",
    "background":"linear-gradient(185deg, #312E81 40%, #7C3AED 75%, #E9D5FF 105%)",
    "description": "A modular React project combining multiple small components like Country Explorer, API CRUD practice, Accordion, and more — all built with the latest React Router DOM.",
    "features": [
      "Home: A simple landing page with header, footer, image, and link to Country section.",
      "Country: Fetches and displays all country data with search, sort (ASC/DESC), filter by region, and detailed country pages.",
      "About: Shows interesting facts about 10 countries using modern CSS layout and animation.",
      "Contact: A form to input name, email, and message — logs data to console instead of sending.",
      "Accordion: Displays 5 React-related Q&A sections using interactive accordion UI.",
      "API Practice: Add/Edit/Delete items using real APIs and controlled inputs styled with CSS3.",
      "GitHub: External link redirects to my GitHub profile."
    ],
    "technologies": [
      "React",
      "React Router DOM (v6+)",
      "JavaScript",
      "CSS3",
      "REST APIs",
      "Vercel"
    ]
  }
  ,
  {
    "title": "Reactfolio",
    "image":"/Project/ReactFolio.png",
    "Link":"https://portfolio-ten-jade-21.vercel.app/",
    "github": "https://github.com/Nitesh47kumars/Portfolio",
    "header":"A platform for creating and sharing code snippets with a clean and intutive design.",
    "color":"text-yellow-200",
    "background":"linear-gradient(195deg, #FF8C61 30%, #E8C547 70%, #FF8C61 100%)",
    "description": "A modern, responsive personal portfolio built with React. It showcases my skills, projects, and includes smooth animations and interactions.",
    "features": [
      "Seamless smooth scrolling across all sections using Lenis.js for an enhanced user experience",
      "Animated UI elements powered by Framer Motion, bringing components to life with smooth transitions",
      "Reusable and modular components built in React for easier maintenance and scalability",
      "Visually engaging animated icons integrated and customized from Gradienty.codes for added interactivity"
    ],
    "technologies": [
      "React",
      "Tailwind CSS",
      "Framer Motion",
      "Lenis.js",   
      "React-Icons",
      "Gradienty Animated Icons"
    ]
  }
]