[
  {
    "title": "Snippit",
    "image": "/Project/Pokemon.png",
    "Link": "https://snippit-five.vercel.app/",
    "github": "https://github.com/Nitesh47kumars/Snippix",
    "header": "A responsive web app for reading, writing, and modifying code with customizable fonts, text sizes, padding, and light/dark themes — supporting multiple languages and allowing export as PDF, JPG, or shareable links.",
    "color": "text-cyan-300",
    "background":"linear-gradient(195deg, #001D4A 30%, #006992 70%, #475569 100%)",
    "description": "A clean, searchable Pokémon showcase built with React and pure CSS. It fetches detailed data like type, stats, and abilities using complex API structures.",
    
    "features": [
      "Search functionality to filter Pokémon by name instantly.",
      "Displays Pokémon info like type, size, stats, abilities, and experience.",
      "Utilizes nested `.map()` methods to extract data from complex API responses.",
      "Responsive UI styled using pure CSS without any utility frameworks.",
      "Loader/Spinner UI while data is being fetched.",
      "Error handling for invalid or failed API responses."
    ],

    "technologies": [
      "React",
      "JavaScript",
      "CSS3 (Pure)",
      "PokéAPI",
      "Vercel",
      "Axios"
    ],

    "whatILearned": [
      "Learned how to work with complex and nested REST APIs using the Pokémon API.",
      "Improved skills in advanced CSS design and responsive layout techniques.",
      "Implemented functional search and filtering UI logic in React.",
      "Understood how to structure dynamic API data into clean, user-friendly components."
    ],

    "keyFeatures": [
      {
        "title": "Pokémon Catalogue Browsing",
        "description": "Users can browse through a large collection of Pokémon, viewing images and basic information for each one."
      },
      {
        "title": "Responsive Design",
        "description": "Layout adapts smoothly for desktop, tablet, and mobile displays to ensure a good experience everywhere."
      },
      {
        "title": "Search or Filter Capabilities",
        "description": "Ability to quickly find particular Pokémon by name or type improves usability in exploring a large dataset."
      },
      {
        "title": "Detail Page for Each Pokémon",
        "description": "Clicking on a Pokémon shows more detailed info (stats, abilities, etc.), helping the user learn more than just the basics."
      },
      {
        "title": "Fast Load Times",
        "description": "Efficient loading of images and data helps reduce waiting, even when viewing many Pokémon entries or switching between them."
      },
      {
        "title": "Intuitive Navigation",
        "description": "Easy-to-use menus/buttons and clear pathways to move between browsing the list and viewing details enhance user flow."
      },
      {
        "title": "Visual Feedback on Interaction",
        "description": "Hover effects or click states to show which elements are interactive, improving confidence and engagement."
      }
    ],

    "techStack": [
      {
        "title": "React.js",
        "description": "JavaScript library for building fast and interactive user interfaces with component-based architecture."
      },
      {
        "title": "Pure CSS",
        "description": "Lightweight and minimal CSS framework offering responsive grid and base styles without JavaScript dependencies."
      },
      {
        "title": "Pokémon API",
        "description": "Public RESTful API providing detailed data about Pokémon, moves, abilities, and types for dynamic UI rendering."
      }
    ]
  }
  ,
  {
    "title": "Info-Nation",
    "image": "/Project/InfoNation.png",
    "Link": "https://info-nation-eight.vercel.app/posts",
    "github": "https://github.com/Nitesh47kumars/Country",
    "header": "A multi-section React application using modern routing and real-world API practices.",
    "color": "text-purple-300",
    "background":"linear-gradient(185deg, #312E81 40%, #7C3AED 75%, #E9D5FF 105%)",
    "description": "A modular React project combining multiple small components like Country Explorer, API CRUD practice, Accordion, and more — all built with the latest React Router DOM.",
    
    "features": [
      "Home: A simple landing page with header, footer, image, and link to Country section.",
      "Country: Fetches and displays all country data with search, sort (ASC/DESC), filter by region, and detailed country pages.",
      "About: Shows interesting facts about 10 countries using modern CSS layout and animation.",
      "Contact: A form to input name, email, and message — logs data to console instead of sending.",
      "Accordion: Displays 5 React-related Q&A sections using interactive accordion UI.",
      "API Practice: Add/Edit/Delete items using real APIs and controlled inputs styled with CSS3.",
      "GitHub: External link redirects to my GitHub profile."
    ],

    "technologies": [
      "React",
      "React Router DOM (v6+)",
      "JavaScript",
      "CSS3",
      "REST APIs",
      "Vercel"
    ],

    "whatILearned": [
      "Gained practical experience with React Router DOM for multi-page navigation.",
      "Worked with multiple APIs including Country API and JSONPlaceholder.",
      "Built full CRUD functionality — including search, add, delete, and update operations.",
      "Learned state management strategies for API-heavy applications using React hooks."
    ],

    "keyFeatures": [
      {
        "title": "Responsive Design",
        "description": "Layout adapts seamlessly across devices — mobile, tablet, desktop — ensuring usability and aesthetics are preserved at various screen sizes."
      },
      {
        "title": "Clean & Modern UI",
        "description": "Minimalist visual style with consistent spacing, typography, and color palette giving a professional and uncluttered look."
      },
      {
        "title": "Fast Load Times",
        "description": "Optimized assets and minimal overhead ensure pages load quickly and smoothly, improving user experience."
      },
      {
        "title": "Informative Data Cards",
        "description": "Key metrics and statistics are displayed using well-structured cards, making it easy for users to digest complex information at a glance."
      },
      {
        "title": "Interactive Navigation",
        "description": "Navigation elements respond visually on hover/click, providing feedback to the user and enhancing engagement."
      },
      {
        "title": "Accessible Layout",
        "description": "Content structure and visual hierarchy support readability with adequate spacing, font sizes, and contrast."
      },
      {
        "title": "Cross‑Browser Compatibility",
        "description": "Site renders correctly across different browsers, maintaining layout, styling, and functionality."
      }
    ],

    "techStack": [
      {
        "title": "React.js",
        "description": "JavaScript library for building fast and interactive user interfaces with component-based architecture."
      },
      {
        "title": "React Router DOM",
        "description": "Declarative routing library for React that enables dynamic, client-side routing and nested routes."
      },
      {
        "title": "Country API",
        "description": "RESTful API providing detailed data about countries including names, flags, regions, and populations."
      },
      {
        "title": "JSONPlaceholder API",
        "description": "Free fake API for prototyping and testing, offering dummy data for users, posts, comments, and more."
      }
    ]
  }
  ,
  {
    "title": "Reactfolio",
    "image":"/Project/ReactFolio.png",
    "Link":"https://portfolio-ten-jade-21.vercel.app/",
    "github": "https://github.com/Nitesh47kumars/Portfolio",
    "header":"A platform for creating and sharing code snippets with a clean and intutive design.",
    "color":"text-yellow-200",
    "background":"linear-gradient(195deg, #FF8C61 30%, #E8C547 70%, #FF8C61 100%)",
    "description": "A modern, responsive personal portfolio built with React. It showcases my skills, projects, and includes smooth animations and interactions.",
    
    "features": [
      "Seamless smooth scrolling across all sections using Lenis.js for an enhanced user experience",
      "Animated UI elements powered by Framer Motion, bringing components to life with smooth transitions",
      "Reusable and modular components built in React for easier maintenance and scalability",
      "Visually engaging animated icons integrated and customized from Gradienty.codes for added interactivity"
    ],
    
    "technologies": [
      "React",
      "Tailwind CSS",
      "Framer Motion",
      "Lenis.js",   
      "React-Icons",
      "Gradienty Animated Icons"
    ],

    "whatILearned": [
      "Built my first ever portfolio using React.js and Tailwind CSS.",
      "Explored Lenis.js for the first time to implement smooth scrolling.",
      "Integrated react-scroll for anchor-based navigation.",
      "Learned how to use third-party UI components effectively within my own React portfolio."
    ],
    
    "keyFeatures": [
      {
        "title": "Responsive Design",
        "description": "Layout adapts seamlessly across devices — mobile, tablet, desktop — ensuring usability and aesthetics are preserved at various screen sizes."
      },
      {
        "title": "Clean & Modern UI",
        "description": "Minimalist visual style with consistent spacing, typography, and color palette giving a professional and uncluttered look."
      },
      {
        "title": "Interactive Navigation",
        "description": "Navigation elements respond visually on hover/click, providing feedback to the user and enhancing engagement."
      },
      {
        "title": "Fast Load Times",
        "description": "Optimized assets and minimal overhead ensure pages load quickly and smoothly, improving user experience."
      },
      {
        "title": "Detailed Project Showcases",
        "description": "Each project includes images/screenshots, descriptions, tech used, and role/contribution to clearly communicate capability and process."
      },
      {
        "title": "Contact & Connectivity",
        "description": "Visible call‑to‑action/contact section enabling visitors to reach out easily; includes links to social profiles or email."
      },
      {
        "title": "Cross‑Browser Compatibility",
        "description": "Site renders correctly across different browsers, maintaining layout, styling, and functionality."
      },
      {
        "title": "Accessible Elements",
        "description": "Clear text, legible fonts, proper contrast, and well‑labelled clickable elements to support usability for more users."
      }
    ],

    "techStack": [
      {
        "title": "React.js",
        "description": "JavaScript library for building fast and interactive user interfaces with component-based architecture."
      },
      {
        "title": "Tailwind CSS",
        "description": "Utility-first CSS framework enabling rapid UI development with responsive design and custom theming."
      },
      {
        "title": "Framer Motion",
        "description": "Animation library for React that enables smooth transitions, gestures, and layout animations."
      },
      {
        "title": "Lenis.js",
        "description": "Smooth scroll library offering better performance and feel compared to default browser scrolling."
      },
      {
        "title": "React Icons",
        "description": "Popular icon pack integration for React with access to thousands of scalable vector icons."
      },
      {
        "title": "Uiverse Components",
        "description": "Open-source animated UI components built with CSS and HTML, ideal for buttons, loaders, and cards."
      },
      {
        "title": "Gradiently.codes",
        "description": "Collection of animated SVG icons with gradients and motion effects for modern UI design."
      }
    ]
  }
]