[
  {
    "title": "Snippit",
    "image": "/Project/Snippit.png",
    "Link": "https://snippit-five.vercel.app/",
    "github": "https://github.com/Nitesh47kumars/Snippix",
    "header": "A customizable React code editor with syntax highlighting, theme control, and export options",
    "color": "text-purple-200",
    "background": "linear-gradient(195deg, #120C2C 25%, #3F1D83 70%, #120C2C 100%)",
    "description": "A responsive web app for reading, writing, and modifying code with customizable fonts, text sizes, padding, and light/dark themes — supporting multiple languages and allowing export as PDF, JPG, or shareable links.",
    
    "features": [
      "Real-time code editing with syntax highlighting using React Syntax Highlighter.",
      "Customization options for font style, text size, padding, and background color.",
      "Light and dark theme toggle for an adaptive editing experience.",
      "Supports multiple programming languages for syntax highlighting.",
      "Export code snippets as PDF or JPG using html2canvas.",
      "Copy code, image, or shareable link directly with one click.",
      "Responsive interface built with React and Tailwind CSS.",
      "Integrated Google Fonts for enhanced typography customization."
    ],

    "technologies": [
      "React",
      "JavaScript",
      "CSS3 (Pure)",
      "Tailwind CSS",
      "React Syntax Highlighter",
      "html2canvas",
      "Google Fonts"
    ],

    "whatILearned": [
      "Learned to capture webpage sections using html2canvas.",
      "Understood how html2canvas renders styled DOM elements.",
      "Integrated react-syntax-highlighter for clean code display.",
      "Improved handling of async rendering in React components.",
      "Enhanced UI by combining visuals with highlighted code."
    ],

    "keyFeatures": [
      {
        "title": "Code Snippet Display",
        "description": "Beautifully formatted code blocks using react-syntax-highlighter for better readability and presentation."
      },
      {
        "title": "Webpage Screenshot Capture",
        "description": "Allows users to capture specific webpage sections as downloadable images using html2canvas."
      },
      {
        "title": "Customizable Capture Area",
        "description": "Users can choose which part of the interface to screenshot for flexible content sharing."
      },
      {
        "title": "Real-Time Preview",
        "description": "Instantly view generated screenshots or highlighted code without page reloads."
      },
      {
        "title": "Responsive and Minimal UI",
        "description": "Clean and responsive layout ensures smooth use across all device sizes."
      },
      {
        "title": "Efficient Rendering",
        "description": "Optimized rendering process ensures fast and accurate image generation even with styled elements."
      },
      {
        "title": "Interactive Developer Experience",
        "description": "Combines visual capture and syntax highlighting for an engaging, developer-focused tool experience."
      }
    ],

    "techStack": [
      {
        "title": "React.js",
        "description": "JavaScript library for building dynamic and reusable user interface components efficiently."
      },
      {
        "title": "JavaScript (ES6+)",
        "description": "Core programming language enabling interactivity, logic, and DOM manipulation in the application."
      },
      {
        "title": "CSS3 (Pure)",
        "description": "Used for styling and layout, providing responsive design and visual consistency across the app."
      },
      {
        "title": "Tailwind CSS",
        "description": "Utility-first CSS framework that allows rapid UI development with flexible, responsive design classes."
      },
      {
        "title": "React Syntax Highlighter",
        "description": "Library for rendering syntax-highlighted code blocks in React, improving code readability and presentation."
      },
      {
        "title": "html2canvas",
        "description": "JavaScript library that captures and converts webpage sections into downloadable image formats seamlessly."
      },
      {
        "title": "Google Fonts",
        "description": "Provides clean and modern typography for a polished and professional visual appearance."
      }
    ]
  }
  ,
  {
    "title": "Resumify",
    "image": "/Project/Resumify.png",
    "Link": "https://resumify-blush-six.vercel.app/",
    "github": "https://github.com/Nitesh47kumars/Resumify",
    "header": "Built Resumify — a free resume builder to create and download professional resumes effortlessly.",
    "color": "text-orange-200",
    "background": "linear-gradient(195deg, #1C1204 25%, #8B4A11 70%, #1C1204 100%)",
    "description": "A modern resume builder web app that allows users to create, preview, and download resumes in PDF format with multiple templates, responsive layouts, editable fields, and session-based auto-save — completely free to use.",
    
    "features": [
      "Multiple resume templates with clean UI layouts",
      "Live preview with instant updates while editing",
      "Export high-quality PDF with working clickable links",
      "SessionStorage support to auto-save user data until browser/tab closed",
      "Mobile responsive design with improved UI/UX",
      "Custom sections and structured input forms"
    ],
  
    "technologies": [
      "React.js",
      "JavaScript",
      "Tailwind CSS",
      "HTML-to-Image",
      "jsPDF",
      "SessionStorage",
      "Vercel"
    ],
  
    "whatILearned": [
      "Implementing PDF export with working hyperlinks",
      "Managing application data using SessionStorage",
      "Learned step-by-step route handling without sudden page jumps",
      "Handling tricky browser rendering issues for print-ready views",
      "Optimizing app layout for mobile users"
    ],
  
    "keyFeatures": [
      {
        "title": "Real-time Resume Preview",
        "description": "Preview updates instantly as you type to maintain a smooth editing experience."
      },
      {
        "title": "PDF Export Ready",
        "description": "High-quality multipage PDF export without losing layout or clickable link functionality."
      },
      {
        "title": "Responsive & Clean UI",
        "description": "Optimized for mobile, tablet, and desktop experiences with modern and minimal UI."
      },
      {
        "title": "Structured Resume Sections",
        "description": "Users can fill different resume fields step by step for organized content flow."
      },      
      {
        "title": "Session Auto Save",
        "description": "Data is saved temporarily using SessionStorage until the browser/tab is closed."
      }
    ],
  
    "techStack": [
      {
        "title": "React.js",
        "description": "Component-based architecture for building dynamic and reusable UI sections."
      },
      {
        "title": "jsPDF + HTML-to-Image",
        "description": "Used to generate clean and crisp downloadable resume PDFs."
      },
      {
        "title": "Tailwind CSS",
        "description": "Utility-first styling to build a modern, responsive interface quickly."
      },
      {
        "title": "SessionStorage",
        "description": "Stores user data temporarily during active session without backend."
      }
    ]
  }  
  ,
  {
    "title": "Reactfolio",
    "image":"/Project/ReactFolio.png",
    "Link":"https://portfolio-ten-jade-21.vercel.app/",
    "github": "https://github.com/Nitesh47kumars/Portfolio",
    "header":"A platform for creating and sharing code snippets with a clean and intutive design.",
    "color": "text-red-200",
    "background": "linear-gradient(195deg, #1A0A0A 25%, #5C1A1A 70%, #1A0A0A 100%)",
    "description": "A modern, responsive personal portfolio built with React. It showcases my skills, projects, and includes smooth animations and interactions.",
    
    "features": [
      "Seamless smooth scrolling across all sections using Lenis.js for an enhanced user experience",
      "Animated UI elements powered by Framer Motion, bringing components to life with smooth transitions",
      "Reusable and modular components built in React for easier maintenance and scalability",
      "Visually engaging animated icons integrated and customized from Gradienty.codes for added interactivity"
    ],
    
    "technologies": [
      "React",
      "Tailwind CSS",
      "Framer Motion",
      "Lenis.js",   
      "React-Icons",
      "Gradienty Animated Icons"
    ],

    "whatILearned": [
      "Built my first ever portfolio using React.js and Tailwind CSS.",
      "Explored Lenis.js for the first time to implement smooth scrolling.",
      "Integrated react-scroll for anchor-based navigation.",
      "Learned how to use third-party UI components effectively within my own React portfolio."
    ],
    
    "keyFeatures": [
      {
        "title": "Responsive Design",
        "description": "Layout adapts seamlessly across devices — mobile, tablet, desktop — ensuring usability and aesthetics are preserved at various screen sizes."
      },
      {
        "title": "Clean & Modern UI",
        "description": "Minimalist visual style with consistent spacing, typography, and color palette giving a professional and uncluttered look."
      },
      {
        "title": "Interactive Navigation",
        "description": "Navigation elements respond visually on hover/click, providing feedback to the user and enhancing engagement."
      },
      {
        "title": "Fast Load Times",
        "description": "Optimized assets and minimal overhead ensure pages load quickly and smoothly, improving user experience."
      },
      {
        "title": "Detailed Project Showcases",
        "description": "Each project includes images/screenshots, descriptions, tech used, and role/contribution to clearly communicate capability and process."
      },
      {
        "title": "Contact & Connectivity",
        "description": "Visible call‑to‑action/contact section enabling visitors to reach out easily; includes links to social profiles or email."
      },
      {
        "title": "Cross‑Browser Compatibility",
        "description": "Site renders correctly across different browsers, maintaining layout, styling, and functionality."
      },
      {
        "title": "Accessible Elements",
        "description": "Clear text, legible fonts, proper contrast, and well‑labelled clickable elements to support usability for more users."
      }
    ],

    "techStack": [
      {
        "title": "React.js",
        "description": "JavaScript library for building fast and interactive user interfaces with component-based architecture."
      },
      {
        "title": "Tailwind CSS",
        "description": "Utility-first CSS framework enabling rapid UI development with responsive design and custom theming."
      },
      {
        "title": "Framer Motion",
        "description": "Animation library for React that enables smooth transitions, gestures, and layout animations."
      },
      {
        "title": "Lenis.js",
        "description": "Smooth scroll library offering better performance and feel compared to default browser scrolling."
      },
      {
        "title": "React Icons",
        "description": "Popular icon pack integration for React with access to thousands of scalable vector icons."
      },
      {
        "title": "Uiverse Components",
        "description": "Open-source animated UI components built with CSS and HTML, ideal for buttons, loaders, and cards."
      },
      {
        "title": "Gradiently.codes",
        "description": "Collection of animated SVG icons with gradients and motion effects for modern UI design."
      }
    ]
  }
]